dfgfdgedrgsdfsedfwerwe-sudo/codebuddy-flasher/dongle_firmware/sdkconfig.defaults
# ESP32-S3-WROOM-1-N16R8 配置
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 控制台改走 USB-Serial/JTAG（独立外设, 不冲突 TinyUSB 的 OTG PHY）,
# 腾出 UART0 (GPIO43/44) 给 pc_link 做 PC↔Dongle 双向串口转发
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# USB PHY 配置（使用内部 PHY 和 OTG 控制器）
CONFIG_USB_OTG_SUPPORTED=y

# WiFi 和网络配置（ESP-NOW 需要 WiFi 驱动和 netif）
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_LWIP_IPV6=n

# FreeRTOS 配置
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# 增加主任务栈大小（默认 3584 字节可能不够）
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# 启用 FreeRTOS 钩子函数用于诊断
CONFIG_FREERTOS_USE_IDLE_HOOK=y
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL=y

# ESP-NOW 配置
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=0

# 日志级别
CONFIG_LOG_DEFAULT_LEVEL_VERBOSE=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_BOOTLOADER_LOG_LEVEL_VERBOSE=y

# PSRAM 配置（ESP32-S3-WROOM-1-N16R8 有 8MB PSRAM）
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
